Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaElementSizeX Property
 Gets or sets the area element size X.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AreaElementSizeX { get; set; }
Public Property AreaElementSizeX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisPartAreaAttributes Class
Tekla.Structures.Analysis Namespace